package myPackage;
/*
 * 큐빙
 * 큐브가 모두 풀린 상태에서 시작.
 * 위: 흰, 아래: 노랑, 앞: 빨, 뒤:주, 왼:초, 오:파
 * 큐브를 돌린 방법이 순서대로 주어질 때, 윗면의 색상 출력
 * 
 * 첫째줄: tc(최대 100개)
 * 각 tc 첫째줄: 큐뷰를 돌린 횟수 n(1<=n<=1000)
 * 각 tc 둘째줄: 큐브를 돌린 방법이 주어진다. 각 방법은 공백으로 구분되어져 있다 
 *            첫 번째 문자는 돌린 면이다.
 * U: 윗 면, D: 아랫 면, F: 앞 면, B: 뒷 면, L: 왼쪽 면, R: 오른쪽 면
 * 두 번째 문자는 돌린 방향이다. +인 경우에는 시계 방향 (그 면을 바라봤을 때가 기준), -인 경우에는 반시계 방향이다.
 * 
 * 각 테스트 케이스에 대해서 큐브를 모두 돌린 후의 윗 면의 색상을 출력한다.
 * 첫 번째 줄에는 뒷 면과 접하는 칸의 색을 출력하고, 두 번째, 세 번째 줄은 순서대로 출력하면 된다. 흰색은 w, 노란색은 y, 빨간색은 r, 오렌지색은 o, 초록색은 g, 파란색은 b.
 */
public class BOJ5373 {
	public static void main(String[] args) throws Exception {
		
	}
}
